Pandas

In [3]:
#  pands  -> Pandas is an open-source library that is used for handle data manipulation.

In [5]:
# # for installing pands in jupter or goolge colab
# #     !pip install pandas

# for installing in vs Code
#     pip install pandas

<!-- # data Structure of Pandas
(1). Series  --> It is one-dimentional array and it shows only values not coulmn

In [7]:
import pandas as pd

In [8]:
a=pd.Series([1,2,3,4,4,2])
a

0    1
1    2
2    3
3    4
4    4
5    2
dtype: int64

DataFrame

We have rto create employee data using dictionary?

In [15]:
a1={'Emp_id':[1,2,3,4,5,6,7,8],
   'Emp_Name':['Sam','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit'],
   'Department':['IT','Sales','IT','Operations','HR','IT','Operations','HR'],
   'Working_hours':[8,9,9,9,9,8,7,8],
   'Salary':[23000,25000,35000,31000,28000,26000,30000,34000]
   }

In [16]:
df=pd.DataFrame(a1)
df

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

How do you export dataframe into csv files?

In [18]:
df.to_csv('Day028_ExportCSVFile.csv',index=False)

In [21]:
df.to_csv('E:\\REGEX\\Python\\Day028_ExportCSVFile.csv',index=False)

In [31]:
csv_import=pd.read_csv('Day028_ExportCSVFile.csv')
csv_import

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [ ]:
# for top elements we use head(n)
csv_import.head(3)

   Emp_id Emp_Name Department  Working_hours  Salary
0       1      Sam         IT              8   23000
1       2      Raj      Sales              9   25000
2       3    Mohit         IT              9   35000

In [ ]:
# for last elemtn we use tail(n)
csv_import.tail(2)

   Emp_id Emp_Name  Department  Working_hours  Salary
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [ ]:
# Home Work
# name,id,stream,fees,semester,department (min 10 rows, and min 5 columns)
# make data from jupiter and import to colab

In [1]:
import pandas as pd

In [2]:
student={'name':['Ashu','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit','Raj','Mohit'],
         'id':[1,2,3,4,5,6,7,8,9,10],
   'stream':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales'],
   'fees':[23000,25000,35000,31000,28000,26000,30000,34000,23000,25000],
   'semester':[1,2,3,4,5,6,7,8,9,10],
   'department':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales']
   }
student_df=pd.DataFrame(student)
student_df.to_csv('Day028_A_ExportCSVFile.csv',index=False)